posts/2020-04-25/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="IBM hosted talk by Sergey Bravyi on achieving " quantum advantage with shallow depth circuits>
<meta name="viewport" content="width=device-width">
<title>Quantum Advantage with Shallow Circuits - Sergey Bravyi | Qoherences</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://h-oll.github.io/qoherences/posts/2020-04-25/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Harold Ollivier">
<meta property="og:site_name" content="Qoherences">
<meta property="og:title" content="Quantum Advantage with Shallow Circuits - Sergey Bravyi">
<meta property="og:url" content="https://h-oll.github.io/qoherences/posts/2020-04-25/">
<meta property="og:description" content='IBM hosted talk by Sergey Bravyi on achieving "Quantum Advantage with Shallow Depth Circuits". '>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-04-25T09:06:34+02:00">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://h-oll.github.io/qoherences/" title="Qoherences" rel="home">
                Qoherences
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Quantum Advantage with Shallow Circuits - Sergey Bravyi
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2020-04-25T09:06:34+02:00">2020/04/25</time>
	    

	    
          |  
        <a href="index.org" id="sourcelink">Source</a>

	  </div>
	  <div class="post-tags">
	  </div>
	</div>
      </div>
    </div>


    <div id="post-main" class="main">
        <div class="container">
        <p>
As part of the Qiskit Channel, IBM hosted on 2020-04-24 a <a href="https://www.youtube.com/watch?v=uwZjUI5eKAk">talk</a> by Sergey Bravyi on achieving Quantum Advantage with Shallow Depth Circuits. 
</p>

<p>
It's starts with a through and step by step introduction to the problem and its importance. First by stating necessary conditions for a good definition of quantum advantage. It needs to:
</p>
<ul class="org-ul">
<li>have an efficient quantum circuit implementation</li>
<li>be classically hard</li>
<li>be verifiable.</li>
</ul>
<p>
While verifiability has always been a concern to people working in the field, it is interesting to see it deeply rooted in Sergey's requirements. Verifiability allows an experimentalist to convince skeptics that he has done a computation that is really solving the problem he stated. That's not obvious as a skeptic could not run a classical computation to check the result! Other models such as VUBQC offer built-in verifiability but we are not yet able to implement these models with the current devices (although photonics looks promising in this respect).
</p>

<p>
In a side remark Sergey made it clear that the problem solved need not be of practical interest. It just needs to be hard to solve classically.
</p>

<p>
The nice surprise is to discover that the result indeed relies on a generalization of the Magic Square Game of Peres and Mermin. The idea is to have a play of the game between Alice and Bob placed at random positions in a quantum register. The other positions would use entanglement swapping to help them solve the game with probability 1. All this can be performed in constant depth (in the number of possible location available / register size). On the other hand, if we play the same game but with access to classical circuits only, because one would need the strategy to work for all positions of Alice and Bob, in a situation where the size of the register increases, it is possible to show that you need logarithmic depth circuits. 
</p>

<p>
It's a very nice result that appeared in Science 362 p308 (2018), and I think the setting also hints at the advantage of small scale quantum computers in entanglement routing networks. 
</p>
            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="qoherences",
            disqus_url="https://h-oll.github.io/qoherences/posts/2020-04-25/",
        disqus_title="Quantum Advantage with Shallow Circuits - Sergey Bravyi",
        disqus_identifier="cache/posts/2020-04-25.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2021         <a href="mailto:harold.ollivier@linksights.io">Harold Ollivier</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><!-- Global site tag (gtag.js) - Google Analytics --><script async src="https://www.googletagmanager.com/gtag/js?id=G-BGX6FC0Q0M"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'G-BGX6FC0Q0M');
</script><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
